Clothing store/Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доход</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Накладная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Clothing store/AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Clothing store/Documents/Продажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	a=Элементы.накладная.ТекущиеДанные.Количество ;
	b=Элементы.накладная.ТекущиеДанные.Номенклатура ;
	УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи)
	Запрос = Новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОстаткиОстатки.Номенклатура КАК Номенклатура,
	              |	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
	              |ИЗ
	              |	РегистрНакопления.Остатки.Остатки КАК ОстаткиОстатки";
	
		
	Результат = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Номенклатура",b);
	//Количество=0;
	Выборка= Результат.Выбрать();
	пока Выборка.НайтиСледующий(b,"Номенклатура") цикл
	Количество = Выборка.Количество;
	конеццикла;
	
	если (a > Количество) тогда
	сообщить("Недостаточно товара, осталось  "+ (Количество) );
	Отказ = Истина;
	иначе
		
	конецесли;
КонецПроцедуры


&НаКлиенте
Процедура НакладнаяКоличествоПриИзменении(Элемент)
	Элементы.накладная.ТекущиеДанные.Сумма=Элементы.накладная.ТекущиеДанные.Количество*Элементы.накладная.ТекущиеДанные.Цена;
КонецПроцедуры
